# Pandas - DataFrame

In [1]:
import numpy as np

In [2]:
import pandas as pd

# Pandas - DataFrames

In [3]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

In [5]:
#the seed here is used to ensure that we are getting the same random number we executed
np.random.seed(101)

In [6]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W', 'X', 'Y', 'Z'])

In [7]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
#accesing data from the table
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [9]:
type(df['W'])

pandas.core.series.Series

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
#another way to grab a table's values, not recommnded you might pass in a method name
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [12]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [13]:
#pandas support the creation of new columns by specifying the name as if it exists

In [14]:
#create a new column
df['NEW'] = df['W'] + df['Y']

In [15]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [16]:
#removing a column
#this method will not affect the dataframe except you add the "inplace" arg
df.drop('NEW', axis=1, inplace=True)

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
#axis 1 is to access the column while axis 0 is to access the row

In [22]:
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df.shape #will output (5,4) and 5 is index zero while 4 is index one, this is why we use 0 and 1 axis

(5, 4)

### selecting columns

In [25]:
df[['W','Y', 'Z']]

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965
C -2.018168  0.528813 -0.589001
D  0.188695 -0.933237  0.955057
E  0.190794  2.605967  0.683509

### selecting rows

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
#loc stands for location
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [28]:
#iloc stands for index location, so you can grab the index location of C as 2
print(df.iloc[2])

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [29]:
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

### to get a specified row and column

In [30]:
df.loc['A','W'] #the row must be passed as the first arg

2.706849839399938

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
#if you want a subset of a b rows and  w y columns
df.loc[['A','B'] ,['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [33]:
new = pd.DataFrame(randn(3,3),['A', 'B', 'C'], [1,2,3])

In [34]:
new

          1         2         3
A  0.302665  1.693723 -1.706086
B -1.159119 -0.134841  0.390528
C  0.166905  0.184502  0.807706

In [35]:
new.loc[['C'],[2]]

          2
C  0.184502

In [36]:
new['new'] = new[1] + new[2]

In [37]:
new

          1         2         3       new
A  0.302665  1.693723 -1.706086  1.996388
B -1.159119 -0.134841  0.390528 -1.293960
C  0.166905  0.184502  0.807706  0.351406

In [38]:
new.drop('new', axis=1)

          1         2         3
A  0.302665  1.693723 -1.706086
B -1.159119 -0.134841  0.390528
C  0.166905  0.184502  0.807706

In [39]:
new

          1         2         3       new
A  0.302665  1.693723 -1.706086  1.996388
B -1.159119 -0.134841  0.390528 -1.293960
C  0.166905  0.184502  0.807706  0.351406


### conditional selection

In [40]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W', 'X', 'Y', 'Z'])

In [41]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [42]:
df < 0

       W      X      Y      Z
A  False  False  False   True
B   True   True  False   True
C  False  False  False   True
D  False   True  False  False
E   True   True  False  False

In [43]:
df > 0

       W      X     Y      Z
A   True   True  True  False
B  False  False  True  False
C   True   True  True  False
D   True  False  True   True
E  False  False  True   True

In [44]:
booldf = df > 0

In [45]:
df[booldf]

          W         X         Y         Z
A  0.072960  0.638787  0.329646       NaN
B       NaN       NaN  0.484752       NaN
C  1.901755  0.238127  1.996652       NaN
D  0.196800       NaN  0.000366  1.025984
E       NaN       NaN  0.649826  2.154846

In [46]:
df[df>0]

          W         X         Y         Z
A  0.072960  0.638787  0.329646       NaN
B       NaN       NaN  0.484752       NaN
C  1.901755  0.238127  1.996652       NaN
D  0.196800       NaN  0.000366  1.025984
E       NaN       NaN  0.649826  2.154846

In [47]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [48]:
df['W']>0

A     True
B    False
C     True
D     True
E    False
Name: W, dtype: bool

In [49]:
df[df>0]

          W         X         Y         Z
A  0.072960  0.638787  0.329646       NaN
B       NaN       NaN  0.484752       NaN
C  1.901755  0.238127  1.996652       NaN
D  0.196800       NaN  0.000366  1.025984
E       NaN       NaN  0.649826  2.154846

In [50]:
#to filter out rows where the values is greater than 0
df[df['W']>0]

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984

In [51]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [52]:
df[df['Z']<0]

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263

In [53]:
resultdf = df[df['W']>0]

In [54]:
#that is for the part C D E where W is greater than 0 return the corresponding values for X there on index 2,3,4
resultdf['X']

A    0.638787
C    0.238127
D   -1.136645
Name: X, dtype: float64

In [55]:
df[df['W']>0]['X']

A    0.638787
C    0.238127
D   -1.136645
Name: X, dtype: float64

In [56]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [57]:
resultdf = df[df['W']>0]

In [58]:
resultdf['X']

A    0.638787
C    0.238127
D   -1.136645
Name: X, dtype: float64

In [59]:
resultdf = df[df['X']>0]
resultdf['Z']

A   -0.497104
C   -0.993263
Name: Z, dtype: float64

In [60]:
resultdf

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
C  1.901755  0.238127  1.996652 -0.993263

In [61]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [62]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [63]:
resultdf = df[df['W']>0]

In [64]:
resultdf

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984

In [65]:
resultdf['Z']

A   -0.497104
C   -0.993263
D    1.025984
Name: Z, dtype: float64

In [66]:
df['W'] > 0

A     True
B    False
C     True
D     True
E    False
Name: W, dtype: bool

In [67]:
df[df['W']>0]

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984

In [68]:
df['W'] > 0

A     True
B    False
C     True
D     True
E    False
Name: W, dtype: bool

In [69]:
df['W']

A    0.072960
B   -0.754070
C    1.901755
D    0.196800
E   -0.156598
Name: W, dtype: float64

In [70]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [71]:
df[df['Z']<0]

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263

In [72]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [73]:
resultdf = df[df['Z']>0]

In [74]:
resultdf

          W         X         Y         Z
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [75]:
"""another way of doing this is"""

df[df['W']>0]['X']

A    0.638787
C    0.238127
D   -1.136645
Name: X, dtype: float64

In [76]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [77]:
df[df['X']>0][['W','Z']]

          W         Z
A  0.072960 -0.497104
C  1.901755 -0.993263

In [78]:
df[df['W']<0][['X','Y']]

          X         Y
B -0.943406  0.484752
E -0.031579  0.649826

In [79]:
df[df['Z']>0][['W','X']]

          W         X
D  0.196800 -1.136645
E -0.156598 -0.031579

In [80]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

# for rows where Z is greater than 1 return the columns of W, Y

In [81]:
df[df['Z']>1][['W','Y']]

          W         Y
D  0.196800  0.000366
E -0.156598  0.649826

In [82]:
#or.......

In [83]:
ZWY = df[df['Z']>1]

In [84]:
ZWY[['W','Y']]

          W         Y
D  0.196800  0.000366
E -0.156598  0.649826

In [85]:
#or

In [86]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [87]:
boolser = df['Z']>0
result = df[boolser]
result[['W','Y']]

          W         Y
D  0.196800  0.000366
E -0.156598  0.649826

In [88]:
#or.......

In [89]:
boolser = df['Z']>0
result = df[boolser]
mycols = ['W','Y']
result[mycols]

          W         Y
D  0.196800  0.000366
E -0.156598  0.649826

In [90]:
boolserz = df['Z']>1
result = df[boolserz]
cols = ['W','Y']
result[cols]

          W         Y
D  0.196800  0.000366
E -0.156598  0.649826

In [91]:
df[df['Z']>1][['W','Y']]

          W         Y
D  0.196800  0.000366
E -0.156598  0.649826

## rows where W is < than 0 and Y is > 1

In [92]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [93]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
C  1.901755  0.238127  1.996652 -0.993263

In [94]:
#THE DATAFRAME OF WHERE W >1 AND Y < 0
df[(df['W']>1) & (df['Z']<1)]

          W         X         Y         Z
C  1.901755  0.238127  1.996652 -0.993263

In [95]:
df[(df['W']<0) & (df['X']<1)]

          W         X         Y         Z
B -0.754070 -0.943406  0.484752 -0.116773
E -0.156598 -0.031579  0.649826  2.154846

In [96]:
df[(df['W']>1) & (df['Z']<1)]

          W         X         Y         Z
C  1.901755  0.238127  1.996652 -0.993263

In [97]:
df[(df['W']>1) & (df['X']<1)]

          W         X         Y         Z
C  1.901755  0.238127  1.996652 -0.993263

In [98]:
df[df['W']>1][['Y','Z']]

          Y         Z
C  1.996652 -0.993263

In [99]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [100]:
#rows where x is less than 0 and z is more than 1

In [101]:
#using the ampersand or and operator

df[(df['X']<0) & (df['Z']>1)]

          W         X         Y         Z
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [102]:
#using the or operator
df[(df['X']<0) | (df['Z']>1)]

          W         X         Y         Z
B -0.754070 -0.943406  0.484752 -0.116773
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [103]:
or_operator = df[(df['X']<1) | (df['Z']>1)]
and_operator = df[(df['X']<1) & (df['Z']>1)]

In [104]:
or_operator

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [105]:
and_operator

          W         X         Y         Z
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [106]:
#use the or operator for z < 0 and Y>1

In [107]:
df[(df['Z']<0) | (df['Y']>1)]

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263

In [108]:
df

          W         X         Y         Z
A  0.072960  0.638787  0.329646 -0.497104
B -0.754070 -0.943406  0.484752 -0.116773
C  1.901755  0.238127  1.996652 -0.993263
D  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846

In [109]:
#to reset the index values of the dataframe

In [110]:
df.reset_index()
#your old index will become a column of the dataframe
#but this will not happen inplace except you specify it to be inplace using the inplace arg

  index         W         X         Y         Z
0     A  0.072960  0.638787  0.329646 -0.497104
1     B -0.754070 -0.943406  0.484752 -0.116773
2     C  1.901755  0.238127  1.996652 -0.993263
3     D  0.196800 -1.136645  0.000366  1.025984
4     E -0.156598 -0.031579  0.649826  2.154846

In [111]:
#how to reset the index using a user defined string

In [112]:
newind = 'CA NY WY OR CO'.split()

In [113]:
df["States"] = newind

In [114]:
df

          W         X         Y         Z States
A  0.072960  0.638787  0.329646 -0.497104     CA
B -0.754070 -0.943406  0.484752 -0.116773     NY
C  1.901755  0.238127  1.996652 -0.993263     WY
D  0.196800 -1.136645  0.000366  1.025984     OR
E -0.156598 -0.031579  0.649826  2.154846     CO

In [115]:
df

          W         X         Y         Z States
A  0.072960  0.638787  0.329646 -0.497104     CA
B -0.754070 -0.943406  0.484752 -0.116773     NY
C  1.901755  0.238127  1.996652 -0.993263     WY
D  0.196800 -1.136645  0.000366  1.025984     OR
E -0.156598 -0.031579  0.649826  2.154846     CO

In [116]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.072960  0.638787  0.329646 -0.497104
NY     -0.754070 -0.943406  0.484752 -0.116773
WY      1.901755  0.238127  1.996652 -0.993263
OR      0.196800 -1.136645  0.000366  1.025984
CO     -0.156598 -0.031579  0.649826  2.154846

In [117]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.072960  0.638787  0.329646 -0.497104
NY     -0.754070 -0.943406  0.484752 -0.116773
WY      1.901755  0.238127  1.996652 -0.993263
OR      0.196800 -1.136645  0.000366  1.025984
CO     -0.156598 -0.031579  0.649826  2.154846

In [118]:
df.set_index('States', inplace=True)

In [119]:
df

               W         X         Y         Z
States
CA      0.072960  0.638787  0.329646 -0.497104
NY     -0.754070 -0.943406  0.484752 -0.116773
WY      1.901755  0.238127  1.996652 -0.993263
OR      0.196800 -1.136645  0.000366  1.025984
CO     -0.156598 -0.031579  0.649826  2.154846

In [120]:
df

               W         X         Y         Z
States
CA      0.072960  0.638787  0.329646 -0.497104
NY     -0.754070 -0.943406  0.484752 -0.116773
WY      1.901755  0.238127  1.996652 -0.993263
OR      0.196800 -1.136645  0.000366  1.025984
CO     -0.156598 -0.031579  0.649826  2.154846

In [121]:
df

               W         X         Y         Z
States
CA      0.072960  0.638787  0.329646 -0.497104
NY     -0.754070 -0.943406  0.484752 -0.116773
WY      1.901755  0.238127  1.996652 -0.993263
OR      0.196800 -1.136645  0.000366  1.025984
CO     -0.156598 -0.031579  0.649826  2.154846

In [122]:
df[df['W']>0][['X','Y']]

               X         Y
States
CA      0.638787  0.329646
WY      0.238127  1.996652
OR     -1.136645  0.000366

In [123]:
df[(df['W']>0) | (df['X']>0)]

               W         X         Y         Z
States
CA      0.072960  0.638787  0.329646 -0.497104
WY      1.901755  0.238127  1.996652 -0.993263
OR      0.196800 -1.136645  0.000366  1.025984

In [124]:
df[(df['X']<0) | (df['W']>1)]

               W         X         Y         Z
States
NY     -0.754070 -0.943406  0.484752 -0.116773
WY      1.901755  0.238127  1.996652 -0.993263
OR      0.196800 -1.136645  0.000366  1.025984
CO     -0.156598 -0.031579  0.649826  2.154846

In [125]:
df

               W         X         Y         Z
States
CA      0.072960  0.638787  0.329646 -0.497104
NY     -0.754070 -0.943406  0.484752 -0.116773
WY      1.901755  0.238127  1.996652 -0.993263
OR      0.196800 -1.136645  0.000366  1.025984
CO     -0.156598 -0.031579  0.649826  2.154846

In [127]:
df[(df['W']>0) | (df['X']<1)]

               W         X         Y         Z
States
CA      0.072960  0.638787  0.329646 -0.497104
NY     -0.754070 -0.943406  0.484752 -0.116773
WY      1.901755  0.238127  1.996652 -0.993263
OR      0.196800 -1.136645  0.000366  1.025984
CO     -0.156598 -0.031579  0.649826  2.154846

In [129]:
df[(df['X']>0) & (df['Y']>1)]

               W         X         Y         Z
States
WY      1.901755  0.238127  1.996652 -0.993263